Центр_управления_производительностью_демо/src/Catalogs/Показатели/Показатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Показатели</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Анализ</name>
      <description>Анализ</description>
    </items>
    <items>
      <name>Взаимоблокировки</name>
      <description>Взаимоблокировки</description>
    </items>
    <items>
      <name>Запросы</name>
      <description>Запросы</description>
    </items>
    <items>
      <name>Качество</name>
      <description>Качество</description>
    </items>
    <items>
      <name>ОжиданияНаБлокировках</name>
      <description>Ожидания на блокировках</description>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ПроизводительностьОборудования</name>
      <description>Производительность оборудования</description>
    </items>
    <items>
      <name>СерверныеВызовы</name>
      <description>Серверные вызовы</description>
    </items>
  </predefined>
  <attributes>
    <name>ГраницаЖК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаЗЖ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Масштаб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметр</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ЯзыкиОС</types>
        <types>EnumRef.СпособыСбораСчетчиков</types>
        <types>CatalogRef.СчетчикиПроизводительности</types>
        <types>CatalogRef.АгентыЦКК</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоддержкаСУБД</name>
    <attributes>
      <name>АвтоматическийРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСУБД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СмешанныйРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОС</name>
      <type>
        <types>EnumRef.ТипыОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСУБД</name>
      <type>
        <types>EnumRef.ТипыСУБД</types>
      </type>
    </attributes>
    <attributes>
      <name>УправляемыйРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/Enums/СпособыСбораСчетчиков/СпособыСбораСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыСбораСчетчиков</name>
  <enumValues>
    <name>PDH</name>
    <comment>Библиотека Performance Data Helper</comment>
  </enumValues>
  <enumValues>
    <name>АгентЦКК</name>
  </enumValues>
</mdclass:Enum>

Центр_управления_производительностью_демо/src/Enums/ТипыПоказателей/ТипыПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПоказателей</name>
  <enumValues>
    <name>АнализВзаимоблокировок</name>
  </enumValues>
  <enumValues>
    <name>АнализГранулярностиБлокировок</name>
  </enumValues>
  <enumValues>
    <name>АнализЗапросов</name>
  </enumValues>
  <enumValues>
    <name>АнализОжиданий</name>
  </enumValues>
  <enumValues>
    <name>АнализСерверныхВызовов</name>
  </enumValues>
  <enumValues>
    <name>ОСВзаимоблокировки</name>
  </enumValues>
  <enumValues>
    <name>ОСТаймауты</name>
  </enumValues>
  <enumValues>
    <name>Предприятие1С</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныеСчетчикиОС</name>
  </enumValues>
</mdclass:Enum>

Центр_управления_производительностью_демо/src/Catalogs/Показатели/ManagerModule.bsl
// Создает элементы справочника "Показатели производительности",
// соответствующие переданным счетчикам производительности ОС
//
// Параметры:
//  СчетчикиПроизводительности  - ТаблицаЗначений - Перечень серверов
//                  и счетчиков производительности, для которых необходимо создать 
//                  элементы справочника "Показатели производительности"
//
Процедура ОбновитьПоказателиПроизводительности(Серверы, СчетчикиОС) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Серверы.НомерСтроки КАК НомерСтроки,
	               |	Серверы.Сервер КАК Сервер,
	               |	Серверы.СпособСбораСчетчиков КАК СпособСбора,
	               |	Серверы.ЯзыкОС КАК ЯзыкОС,
	               |	Серверы.АгентЦКК КАК АгентЦКК
	               |ПОМЕСТИТЬ Серверы
	               |ИЗ
	               |	&Серверы КАК Серверы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СчетчикиПроизводительности.НомерСтрокиСервера КАК НомерСтрокиСервера,
	               |	СчетчикиПроизводительности.Счетчик КАК Счетчик
	               |ПОМЕСТИТЬ Счетчики
	               |ИЗ
	               |	&СчетчикиПроизводительности КАК СчетчикиПроизводительности
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Серверы.Сервер КАК Сервер,
	               |	Серверы.СпособСбора КАК СпособСбора,
	               |	Серверы.ЯзыкОС КАК ЯзыкОС,
	               |	Серверы.АгентЦКК КАК АгентЦКК,
	               |	Счетчики.Счетчик КАК Счетчик
	               |ПОМЕСТИТЬ СчетчикиРазвернутые
	               |ИЗ
	               |	Серверы КАК Серверы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Счетчики КАК Счетчики
	               |		ПО Серверы.НомерСтроки = Счетчики.НомерСтрокиСервера
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоказателиПараметр.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ПоказателиПараметр.Имя = ""Сервер""
	               |				ТОГДА ПоказателиПараметр.Значение
	               |			ИНАЧЕ NULL
	               |		КОНЕЦ) КАК Сервер,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ПоказателиПараметр.Имя = ""Счетчик производительности""
	               |				ТОГДА ПоказателиПараметр.Значение
	               |			ИНАЧЕ NULL
	               |		КОНЕЦ) КАК Счетчик,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ПоказателиПараметр.Имя = ""Язык ОС""
	               |				ТОГДА ПоказателиПараметр.Значение
	               |			ИНАЧЕ NULL
	               |		КОНЕЦ) КАК ЯзыкОС,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ПоказателиПараметр.Имя = ""Агент ЦКК""
	               |				ТОГДА ПоказателиПараметр.Значение
	               |			ИНАЧЕ NULL
	               |		КОНЕЦ) КАК АгентЦКК,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ПоказателиПараметр.Имя = ""Способ сбора счетчика""
	               |				ТОГДА ПоказателиПараметр.Значение
	               |			ИНАЧЕ NULL
	               |		КОНЕЦ) КАК СпособСбора
	               |ПОМЕСТИТЬ СуществующиеПоказатели
	               |ИЗ
	               |	Справочник.Показатели.Параметр КАК ПоказателиПараметр
	               |ГДЕ
	               |	ПоказателиПараметр.Ссылка.Родитель = ЗНАЧЕНИЕ(Справочник.Показатели.ПроизводительностьОборудования)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоказателиПараметр.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СчетчикиРазвернутые.Сервер КАК Сервер,
	               |	СчетчикиРазвернутые.Счетчик КАК Счетчик,
	               |	СчетчикиРазвернутые.СпособСбора КАК СпособСбора,
	               |	СчетчикиРазвернутые.ЯзыкОС КАК ЯзыкОС,
	               |	СчетчикиРазвернутые.АгентЦКК КАК АгентЦКК,
	               |	СуществующиеПоказатели.Ссылка КАК Показатель
	               |ИЗ
	               |	СчетчикиРазвернутые КАК СчетчикиРазвернутые
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СуществующиеПоказатели КАК СуществующиеПоказатели
	               |		ПО СчетчикиРазвернутые.Сервер = СуществующиеПоказатели.Сервер
	               |			И СчетчикиРазвернутые.Счетчик = СуществующиеПоказатели.Счетчик
	               |ГДЕ
	               |	(СуществующиеПоказатели.Ссылка ЕСТЬ NULL
	               |			ИЛИ СчетчикиРазвернутые.ЯзыкОС <> ЕСТЬNULL(СуществующиеПоказатели.ЯзыкОС, ЗНАЧЕНИЕ(Справочник.ЯзыкиОС.ПустаяСсылка))
	               |			ИЛИ СчетчикиРазвернутые.АгентЦКК <> ЕСТЬNULL(СуществующиеПоказатели.АгентЦКК, ЗНАЧЕНИЕ(Справочник.АгентыЦКК.ПустаяСсылка))
	               |			ИЛИ СчетчикиРазвернутые.СпособСбора <> ЕСТЬNULL(СуществующиеПоказатели.СпособСбора, ЗНАЧЕНИЕ(Перечисление.СпособыСбораСчетчиков.ПустаяСсылка)))";
	
	Запрос.УстановитьПараметр("Серверы", Серверы);
	Запрос.УстановитьПараметр("СчетчикиПроизводительности", СчетчикиОС);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Показатель) Тогда
			ПоказательОбъект = Выборка.Показатель.ПолучитьОбъект();
		Иначе
			ПоказательОбъект = Справочники.Показатели.СоздатьЭлемент();
			ПоказательОбъект.Наименование = Выборка.Сервер + Строка(Выборка.Счетчик);
			ПоказательОбъект.УстановитьНовыйКод("_34_P0");
			ПоказательОбъект.Родитель = Справочники.Показатели.ПроизводительностьОборудования;
			ПоказательОбъект.ГраницаЗЖ = 0;
			ПоказательОбъект.ГраницаЖК = 0;
			ПоказательОбъект.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмерения.ПустаяСсылка();
			ПоказательОбъект.Интерактивный = Истина;
			ТипЛинии = ТипЛинииДиаграммы.Сплошная;
			ТолщинаЛинии = 1;
			ПоказательОбъект.Линия = Новый ХранилищеЗначения(Новый Линия(ТипЛинии, ТолщинаЛинии));
			ПоказательОбъект.Масштаб = 1;
			ПоказательОбъект.Тип = Перечисления.ТипыПоказателей.ПроизвольныеСчетчикиОС;
			ПоказательОбъект.Цвет = Новый ХранилищеЗначения(WebЦвета.Черный);
			
			ПоддержкаСУБД = ПоказательОбъект.ПоддержкаСУБД.Добавить();
			ПоддержкаСУБД.АвтоматическийРежим = Истина;
			ПоддержкаСУБД.СмешанныйРежим = Истина;
			ПоддержкаСУБД.УправляемыйРежим = Истина;
		КонецЕсли;
		
		ПоказательОбъект.Параметр.Очистить();
		ПараметрПоказателя = ПоказательОбъект.Параметр.Добавить();
		ПараметрПоказателя.Имя = "Сервер";
		ПараметрПоказателя.Значение = Выборка.Сервер;
		
		ПараметрПоказателя = ПоказательОбъект.Параметр.Добавить();
		ПараметрПоказателя.Имя = "Счетчик производительности";
		ПараметрПоказателя.Значение = Выборка.Счетчик;
		
		ПараметрПоказателя = ПоказательОбъект.Параметр.Добавить();
		ПараметрПоказателя.Имя = "Способ сбора счетчика";
		ПараметрПоказателя.Значение = Выборка.СпособСбора;
		
		ПараметрПоказателя = ПоказательОбъект.Параметр.Добавить();
		ПараметрПоказателя.Имя = "Язык ОС";
		ПараметрПоказателя.Значение = Выборка.ЯзыкОС;
		
		ПараметрПоказателя = ПоказательОбъект.Параметр.Добавить();
		ПараметрПоказателя.Имя = "Агент ЦКК";
		ПараметрПоказателя.Значение = Выборка.АгентЦКК;
		
		ПоказательОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры // ОбновитьПоказателиПроизводительности()
